Repository: LdrPontes/habit-tracker-tetris
Catalog: flutter/lib/core/localization/app_*.arb
Languages: pt

# auth_error_google_sign_in_failed
source: Google sign in failed. Please try again.
pt: Falha ao entrar com Google. Tente novamente.

# auth_error_google_id_token_not_found
source: Sorry, we couldn't sign you in with Google. Please try again.
pt: Token de ID do Google não encontrado. Tente novamente.

# auth_error_apple_sign_in_failed
source: Apple sign in failed. Please try again.
pt: Falha ao entrar com Apple. Tente novamente.

# auth_error_unknown_error
source: An unknown error occurred. Please try again.
pt: Ocorreu um erro desconhecido. Tente novamente.

# auth_error_apple_id_token_not_found
source: Sorry, we couldn't sign you in with Apple. Please try again.
pt: Não foi possível entrar com Apple. Tente novamente.

# auth_error_user_already_exists
source: A user with this email already exists.
pt: Um usuário com este email já existe.

# auth_error_user_not_found
source: User not found. Please check your credentials.
pt: Usuário não encontrado. Verifique suas credenciais.

# auth_error_user_invalid_credentials
source: Invalid credentials. Please check your email and password.
pt: Credenciais inválidas. Verifique seu email e senha.

# auth_error_email_not_confirmed
source: Please confirm your email address before signing in.
pt: Por favor, confirme seu endereço de email antes de entrar.

# auth_error_same_password
source: New password must be different from your current password.
pt: A nova senha deve ser diferente da sua senha atual.

# auth_error_email_send_rate_limit
source: For security purposes, you can only request this after 1 minute.
pt: Por motivos de segurança, você só pode solicitar isso após 1 minuto.

# welcome_description
source: Register your journey in a visual and fun way
pt: Registre sua jornada de uma forma visual e divertida

# start_button
source: Let's start
pt: Começar

source: Back
pt: Voltar

# sign_in_title
source: Sign in
pt: Iniciar Sessão

source: Password
pt: Senha

source: Sign in
pt: Entrar

source: Forgot password?
pt: Esqueceu sua senha?

source: or
pt: ou

source: Continue with Google
pt: Entrar com Google

source: Continue with Apple
pt: Entrar com Apple

# sign_up_call_to_action
source: Don't have an account?
pt: Ainda não tem uma conta?

source: Sign up
pt: Cadastre-se

# sign_up_title
source: Create Account
pt: Criar Conta

source: Sign up with Email
pt: Cadastre-se com E-mail

# sign_in_call_to_action
source: Already have an account?
pt: Já tem uma conta?

source: Name
pt: Nome

# validation_error_name_required
source: Name is required
pt: Nome é obrigatório

# validation_error_email_required
source: Email is required
pt: Email é obrigatório

# validation_error_email_invalid
source: Email is invalid
pt: Email é inválido

# validation_error_password_required
source: Password is required
pt: Senha é obrigatória

# validation_error_password_min_length
source: Password must be at least 6 characters long
pt: Senha deve ter pelo menos 6 caracteres

# validation_error_password_invalid
source: Password must contain at least one uppercase letter, one lowercase letter, one number and one special character
pt: Senha deve conter pelo menos uma letra maiúscula, uma letra minúscula, um número e um caractere especial

# confirm_your_email
source: Check your email and confirm your account
pt: Verifique seu email e confirme sua conta

# check_your_email_title
source: Check your email
pt: Verifique seu email

# check_your_email_description
source: Visit your inbox and click the link to verify your email address
pt: Acesse sua caixa de entrada e clique no link para verificar seu endereço de email

source: I didn't get an email
pt: Não recebi um email

# resend_email_cooldown
source: Resend email in {seconds} seconds
pt: Reenviar email em {seconds} segundos

# create_account
source: Create an account
pt: Criar conta

# forgot_password_title
source: Forgot Password
pt: Esqueceu a Senha

source: Send Reset Link
pt: Enviar Link de Redefinição

# reset_password_title
source: Reset Password
pt: Redefinir Senha

source: New Password
pt: Nova Senha

source: Confirm Password
pt: Confirmar Senha

source: Reset Password
pt: Redefinir Senha

# validation_error_password_confirm_required
source: Please confirm your password
pt: Por favor, confirme sua senha

# validation_error_passwords_do_not_match
source: Passwords do not match
pt: As senhas não coincidem

# password_reset_link_sent
source: Password reset link sent to your email
pt: Link de redefinição de senha enviado para seu email

source: Password reset successfully
pt: Senha redefinida com sucesso

# start_onboarding
source: Let's start!
pt: Vamos começar!

# start_onboarding_title
source: Welcome aboard! You're off to a great start.
pt: Que bom que você chegou! Tá voando.

# start_onboarding_description
source: Just a few quick questions and you'll get your first piece!
pt: Responda algumas perguntas para receber sua primeira peça!

# onboarding_first_question
source: What is your goal using Blockin?
pt: Qual o seu objetivo usando o Blockin?

# onboarding_first_question_option_1
source: Develop new habits
pt: Desenvolver novos hábitos

# onboarding_first_question_option_2
source: Make the process fun
pt: Tornar o processo divertido

# onboarding_first_question_option_3
source: Document my journey
pt: Documentar minha jornada

# onboarding_first_question_option_4
source: Increase motivation and consistency
pt: Aumentar a motivação e consistência

# onboarding_first_question_option_5
source: Other
pt: Outro

# onboarding_second_question
source: What is your age?
pt: Qual é a sua idade?

# onboarding_second_question_option_1
source: Under 18
pt: Até 18 anos

# onboarding_second_question_option_2
source: 19 to 24
pt: 19 a 24 anos

# onboarding_second_question_option_3
source: 25 to 34
pt: 25 a 34 anos

# onboarding_second_question_option_4
source: 35 to 44
pt: 35 a 44 anos

# onboarding_second_question_option_5
source: 45 to 54
pt: 45 a 54 anos

# onboarding_second_question_option_6
source: 55 to 64
pt: 55 a 64 anos

# onboarding_second_question_option_7
source: 65 or older
pt: 65 anos ou mais

# onboarding_third_question
source: How did you hear about us?
pt: Como você nos conheceu?

# onboarding_third_question_option_5
source: Friends and/or family
pt: Amigos e/ou familiares

# onboarding_third_question_option_6
source: Influencers
pt: Influenciadores

# onboarding_third_question_option_7
source: Other
pt: Outros

# onboarding_fourth_question
source: Have you tried other habit tracker apps?
pt: Você já testou outros apps de gestão de hábitos?

# onboarding_fourth_question_option_1
source: Yes
pt: Sim

# onboarding_fourth_question_option_2
source: No
pt: Não

# onboarding_notification_title
source: Keep consistency, activate our reminders
pt: Mantenha a consistência, ative nossos lembretes

# continue_button
source: Continue
pt: Continuar

source: Blockin: Daily Habits
pt: Blockin: Hábitos Diários

# only_two_more_goals
source: Only two more goals for today!
pt: Só mais 02 objetivos para hoje!

# only_three_more_goals
source: Only three more pieces to reach your next goal!
pt: Faltam apenas três peças para você atingir seu próximo objetivo!

# onboarding_finished_title
source: All set! Let's place your first block to celebrate
pt: Tudo pronto! Vamos colocar seu primeiro bloco para comemorar
